---
kind: other
id: Methods.T:Autodesk.Revit.DB.RevolvedSurface
source: html/28d19acd-7922-2452-a1b4-dc22b436fba2.htm
---
# RevolvedSurface Methods

Creates a Surface object coincident with the surface of revolution defined by a coordinate frame and a profile curve.